# Exercicio 2

a) Crie um programa em pandas para ler o arquivo em Excel imobiliária.xlsx
b) e coloque em um dataframe.
c) Visualize o cabeçalho dos dados;
d) Visualize as últimas linhas;
e) Escreva um programa para renomear o cabeçalho da tabela com os
f) seguintes nomes:

In [2]:
# Importar a bibliotec
import pandas as pd

# Caminho do arquivo
caminho = "C:\\\\Users\\\\FIC\\\\Documents\\\\Carlos Zanelato_Python\\\\Arquivos\\\\Imobiliária.xlsx"

# Carregar um arquivo para um dataframe
df = pd.read_excel(caminho)

df.head()

,Coluna 1,Coluna 2,Coluna 3,Coluna 4,Coluna 5,Coluna 6,Coluna 7,Coluna 8,Coluna 8.1,Coluna 10
0,Centro,Simone,2005-10-08,Apartamento,102.5,2,2,Sim,235500,3532.5
1,Noroeste,Simone,2005-10-08,Apartamento,199.5,4,4,Não,377700,5665.5
2,Norte,Roberto,2005-10-12,Casa,145.5,2,2,Não,232500,3487.5
3,Sudeste,Simone,2005-10-14,Apartamento,153.5,3,2,Não,289100,4336.5
4,Noroeste,Cristina,2005-10-16,Apartamento,93.0,2,2,Sim,235400,3531.0

In [3]:
df.tail()

,Coluna 1,Coluna 2,Coluna 3,Coluna 4,Coluna 5,Coluna 6,Coluna 7,Coluna 8,Coluna 8.1,Coluna 10
1112,Sudeste,Cristina,2011-03-19,Apartamento,87.5,2,0,Não,221500,3322.5
1113,Sudeste,Simone,2011-03-20,Apartamento,74.5,2,2,Não,224400,3366.0
1114,Norte,João Carlos,2011-03-21,Apartamento,192.0,4,4,Não,361000,5415.0
1115,Leste,Simone,2011-03-27,Apartamento,42.0,1,1,Sim,167900,2518.5
1116,Oeste,Simone,2011-03-28,Apartamento,100.5,2,2,Sim,227600,3414.0

In [12]:
df.columns=['filial',
            'vendedor',
            'data',
            'tipo',
            'area',
            'dorms',
            'garag',
            'piscina',
            'preço',
            'comissão']

df.head()

,filial,vendedor,data,tipo,area,dorms,garag,piscina,preço,comissão
0,Centro,Simone,2005-10-08,Apartamento,102.5,2,2,Sim,235500,3532.5
1,Noroeste,Simone,2005-10-08,Apartamento,199.5,4,4,Não,377700,5665.5
2,Norte,Roberto,2005-10-12,Casa,145.5,2,2,Não,232500,3487.5
3,Sudeste,Simone,2005-10-14,Apartamento,153.5,3,2,Não,289100,4336.5
4,Noroeste,Cristina,2005-10-16,Apartamento,93.0,2,2,Sim,235400,3531.0

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1117 entries, 0 to 1116
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   filial    1117 non-null   object
 1   vendedor  1117 non-null   object
 2   data      1117 non-null   datetime64[ns]
 3   tipo      1117 non-null   object
 4   area      1117 non-null   float64
 5   dorms     1117 non-null   int64
 6   garag     1117 non-null   int64
 7   piscina   1117 non-null   object
 8   preço     1117 non-null   int64
 9   comissão  1117 non-null   float64
dtypes: datetime64[ns](1), float64(2), int64(3), object(4)
memory usage: 87.4+ KB

In [20]:
df['preço'].sum()

295035000

In [21]:
df['preço'].mean()

264131.6025067144

In [22]:
df['preço'].max()

384300

In [23]:
df['preço'].min()

145100

In [24]:
df['preço'].count()

1117

In [25]:
df['preço'].std()

77249.57838462107

# 8. Crie um programa para criar um dataframe para mostrar as vendas por região, e salvar um arquivo em Excel para cada região.

In [30]:
# Filtrar os dados

df_final = df[df['filial']=='Centro']

# Mapear o caminho final e definir um nome para o arquivo

caminho= "C:\\Users\\FIC\\Documents\\Carlos Zanelato_Python\\Relatórios Filiais\\"
arquivo= 'centro.xlsx'

# Salvar o arquivo na pasta

df_final.to_excel(caminho + arquivo)